In [1]:
import pandas as pd

In [40]:
data1 = pd.read_excel(r'C:\Users\dell\Desktop\DT\MyData1.xlsx')

In [41]:
data1

    Name  Age  Salary
0  pinky   30   30000
1    raj   20   53000
2  rohan   45   55000
3  manuj   35   80000

In [32]:
data2 = pd.read_csv(r'C:\Users\dell\Desktop\DT\Mydata2.csv')

data2

In [26]:
data3 = pd.read_csv(r'C:\Users\dell\Desktop\DT\Mydata3.tsv',sep='\t')

In [28]:
data3

   RollNo   Name  Batch
0    1001  pinky   1840
1    1002   John   1083
2    1003   Neha   3842
3    1004    Raj   1938

In [33]:
data2

   Roll no    Name  Batch
0     1001  Pinky    1804
1     1002     Raj   1805
2     1003   Mohit   1806
3     1004   Rohan   1807

In [42]:
import os

In [43]:
os.getcwd()

'C:\\Users\\dell'

In [44]:
data4 = pd.read_excel(r'MyData1.xlsx')

In [45]:
data4

    Name  Age  Salary
0  pinky   30   30000
1    raj   20   53000
2  rohan   45   55000
3  manuj   35   80000